DELETE FROM meals;
DELETE FROM user_roles;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (userid, datetime, description, calories)
VALUES (100000, '2020-01-30T10:00:00', 'Завтрак', 500),
       (100000, '2020-01-30T13:00:00', 'Обед', 1000),
       (100000, '2020-01-30T20:00:00', 'Ужин', 500),
       (100000, '2020-01-31T00:00:00', 'Еда на граничное значение', 100),
       (100000, '2020-01-31T10:00:00', 'Завтрак', 1000),
       (100000, '2020-01-31T13:00:00', 'Обед', 1000),
       (100000, '2020-01-31T20:00:00', 'Ужин', 500),
       (100001, '2020-01-30T00:00:00', 'AЕда на граничное значение', 100),
       (100001, '2020-01-30T10:00:00', 'АЗавтрак', 500),
       (100001, '2020-01-30T13:00:00', 'АОбед', 500),
       (100001, '2020-01-30T20:00:00', 'АУжин', 410),
       (100001, '2020-01-31T10:00:00', 'AЗавтрак', 1000),
       (100001, '2020-01-31T13:00:00', 'AОбед', 500),
       (100001, '2020-01-31T20:00:00', 'AУжин', 410);